/* No comment provided by engineer. */
" (optimization:%@, debug-symbols:%@)" = " (optimization:%@, debug-symbols:%@)";

/* String appended when a request is completely successfully and we have a specific status to report. */
" completed successfully." = " completed successfully.";

/* Format string for describing build style using during a build -- the two character arguments are just curly quotes, the object argument is the build style name */
" with build style %C%@%C" = " with build style %C%@%C";

/* Message when multiple buildables cannot be built because other build operations are building them. */
"%lu targets are being built by other builds; this build will begin once those builds have completed..." = "%lu targets are being built by other builds; this build will begin once those builds have completed…";

/* Message when a buildable cannot be built because another build operation is building it. */
"'%@' is being built by another build; this build will begin once the other build has completed..." = "'%@' is being built by another build; this build will begin once the other build has completed…";

/* Format string for build log container item for Building or Cleaning operation. */
"%@ %@ of project %@ with configuration %@" = "%@ %@ of project %@ with configuration %@";

/* Format string for the default name of a build rule.  First argument is the file type.  Second argument is the compiler */
"%@ using %@" = "%@ using %@";

/* Format string used to report running SCM request. */
"%@ waiting for reply..." = "%@ waiting for reply…";

/* Plural error count string; arg is number of errors */
"%i errors" = "%i errors";

/* Plural warning count string; arg is number of warnings */
"%i warnings" = "%i warnings";

/* Plural analyzer result count string; arg is number of analyzer results */
"%i analyzer results" = "%i analyzer results";

/* Singular error count string */
"1 error" = "1 error";

/* Singular warning count string */
"1 warning" = "1 warning";

/* Singular analyzer result count string */
"1 analyzer result" = "1 analyzer result";

/* Default name for bookmark items. */
"<No name>" = "<No name>";

/* String to use in build rule name for an undefined file type. */
"<Undefined file type>" = "<Undefined file type>";

/* String to use in build rule name for an undefined file compiler. */
"<Unknown compiler>" = "<Unknown compiler>";

/* Display name for aggregate targets */
"Aggregate" = "Aggregate";

/* Display name for application targets */
"Application" = "Application";

/* localized type name for architecture specifications */
"architecture" = "architecture";

/* Result string shown when a build operation has stopped due to errors. */
"Build failed " = "Build failed";

/* Result string shown when a build operation has stopped due to errors and a build style is being used. */
"Build failed for target \"%@\" using build style \"%@\"" = "Build failed for target \"%@\" using build style \"%@\"";

/* Result string shown when a build operation has stopped due to errors and no build style is being used. */
"Build failed for target \"%@\" of project \"%@\"" = "Build failed for target \"%@\" of project \"%@\"";

/* Error message shown when a build fails for unknown reason */
"Build failed (see build log for details)" = "Build failed (see build log for details)";

/* Error message shown when a build fails for unknown reason and there is a hyperlink to the build log.  The text between the <{[ and the ]}> markers will be the hyperlink on which users can click to select the corresponding text in the build log. */
"Build failed (see <{[build log]}> for details)" = "Build failed (see <{[build log]}> for details)";

/* Default name of the Build Java Resources build phase. */
"Build Java Resources" = "Build Java Resources";

/* Default name of the Build Resource Manager Resources build phase. */
"Build Resource Manager Resources" = "Build Resource Manager Resources";

/* localized type name for build settings specifications */
"build settings" = "build settings";

/* Error string when a build setting contains an invalid base name; arg 1 is name of build setting. */
"Build setting '%@' does not have a valid base name" = "Build setting '%@' does not have a valid base name";

/* Error string when a build setting is not well-formed; arg 1 is name of build setting. */
"Build setting '%@' is not well-formed" = "Build setting '%@' is not well-formed";

/* String for build settings conversion header in the native target upgrading log. */
"Build settings conversion" = "Build settings conversion";

/* localized type name for build settings pane specifications */
"build settings pane" = "build settings pane";

/* Result string shown when a build operation has been stopped by the user. */
"Build stopped" = "Build stopped";

/* Result string shown when a build operation has been stopped by the user and a build style is being used. */
"Build stopped for target \"%@\" using build style \"%@\"" = "Build stopped for target \"%@\" using build style \"%@\"";

/* Result string shown when a build operation has been stopped by the user and no build style is being used. */
"Build stopped for target \"%@\" of project \"%@\"" = "Build stopped for target \"%@\" of project \"%@\"";

/* Format for name of build style bookmarks -- arg 1 is name of build style */
"Build style: %@" = "Build style: %@";

/* Result string shown when a build operation has finished successfully */
"Build succeeded" = "Build succeeded";

/* Result string shown when a build operation has finished successfully and a build style is being used. */
"Build succeeded for target \"%@\" using build style \"%@\"" = "Build succeeded for target \"%@\" using build style \"%@\"";

/* Result string shown when a build operation has finished successfully and no build style is being used. */
"Build succeeded for target \"%@\" of project \"%@\"" = "Build succeeded for target \"%@\" of project \"%@\"";

/* String displayed for the 'build' build action in the build log item for a target. */
"Build" = "Build";

/* Display name for bundle targets */
"Bundle" = "Bundle";

/* Result string shown when a clean operation has stopped due to errors. */
"Clean failed" = "Clean failed";

/* Result string shown when a clean operation has stopped due to errors and a build style is being used. */
"Clean failed for target \"%@\" using build style \"%@\"" = "Clean failed for target \"%@\" using build style \"%@\"";

/* Result string shown when a clean operation has stopped due to errors and no build style is being used. */
"Clean failed for target \"%@\" of project \"%@\"" = "Clean failed for target \"%@\" of project \"%@\"";

/* Result string shown when a clean operation has been stopped by the user. */
"Clean stopped" = "Clean stopped";

/* Result string shown when a clean operation has been stopped by the user and a build style is being used. */
"Clean stopped for target \"%@\" using build style \"%@\"" = "Clean stopped for target \"%@\" using build style \"%@\"";

/* Result string shown when a clean operation has been stopped by the user and no build style is being used. */
"Clean stopped for target \"%@\" of project \"%@\"" = "Clean stopped for target \"%@\" of project \"%@\"";

/* Result string shown when a clean operation has finished successfully. */
"Clean succeeded" = "Clean succeeded";

/* Result string shown when a clean operation has finished successfully and a build style is being used. */
"Clean succeeded for target \"%@\" using build style \"%@\"" = "Clean succeeded for target \"%@\" using build style \"%@\"";

/* Result string shown when a clean operation has finished successfully and no build style is being used. */
"Clean succeeded for target \"%@\" of project \"%@\"" = "Clean succeeded for target \"%@\" of project \"%@\"";

/* String displayed for the 'clean' build action in the build log item for a target. */
"Clean" = "Clean";

/* Error message shown when a command fails with a non-zero exit code without emitting any errors.  Arg 1 is the name of the command, arg 2 is the exit code, arg 3 is a string containing supplemental information from the underlying function call (might be an empty string). */
"Command %@ failed with exit code %i%@" = "Command %@ failed with exit code %i%@";

/* Error message shown when a command terminates with a signal (usually because it crashed).  Arg 1 is the name of the command, arg 2 is a string representation of the signal, arg 3 is a string containing supplemental information from the underlying function call (might be an empty string). */
"Command %@ terminated with signal %@%@" = "Command %@ terminated with signal %@%@";

/* SCM 'committable conflict' status */
"Committable Conflict" = "Committable Conflict";

/* localized type name for compiler specifications */
"compiler" = "compiler";

/* Default name of the Compile Sources build phase. */
"Compile Sources" = "Compile Sources";

/* Default name of the Compile and Link build phase. */
"Compile and Link" = "Compile and Link";
"Compile and Link Executable" = "Compile and Link Executable";

/* Default name of the Compile AppleScript Files build phase. */
"Compile AppleScript Files" = "Compile AppleScript Files";

/* Error string when a build setting contains an unsupported condition flavor; arg 1 is rejected condition flavor, arg 2 is name of build setting. */
"Condition flavor '%@' in build setting '%@' is not supported" = "Condition flavor '%@' in build setting '%@' is not supported";

/* SCM 'conflict' status */
"Conflict" = "Conflict";

/* SCM 'Incomplete' status */
"Incomplete" = "Incomplete";

/* SCM 'Obstructed' status */
"Obstructed" = "Obstructed";

/* SCM 'Missing' status */
"Missing" = "Missing";

/* localized display state string for the SCM 'conflict' state */
"Conflicts" = "Conflicts";

/* Default name of the Copy Bundle Resources build phase. */
"Copy Bundle Resources" = "Copy Bundle Resources";

/* Default name of the Copy Files build phase. */
"Copy Files" = "Copy Files";

/* Default name of the Copy Headers build phase. */
"Copy Headers" = "Copy Headers";

/* Default name of the Copy Public Headers build phase. */
"Copy Public Headers" = "Copy Public Headers";

/* Default name of the Copy Private Headers build phase. */
"Copy Private Headers" = "Copy Private Headers";

/* The format for a duplicate build configuration name. */
"%@ copy" = "%@ copy";

/* Suffix to be used for unique naming for new (duplicated) targets or executables. */
" copy" = " copy";

/* Default name of the Embed Public Headers build phase. */
"Embed Public Headers" = "Embed Public Headers";

/* Default name of the Embed Private Headers build phase. */
"Embed Private Headers" = "Embed Private Headers";

/* Display name for custom-build-tool targets */
"Custom Build Tool Target" = "Custom Build Tool Target";

/* String to display in popup menu to indicate that a build rule's compiler should be a custom script. */
"Custom script:" = "Custom script:";

/* String indicating that a build setting has been deleted in the native target upgrading log.  Arg 1 is setting name. */
"Deleted %@" = "Deleted %@";

/* Name of default 'Deployment' build style created for new projects */
"Deployment" = "Deployment";

/* Name of default 'Development' build style created for new projects */
"Development" = "Development";

/* Format string for presenting a cvs error. */
"Error: %@" = "Error: %@";

/* Name template for executable bookmarks.  Argument is replaced with executable name. */
"Executable: %@" = "Executable: %@";

/* String indicating that text has been extracted from a build setting and appended to another build setting in the native target upgrading log.  Arg 1 is value extracted, arg 2 is the old setting name, arg 3 is the new setting name. */
"Extracted value '%@' from %@ and appended it to %@" = "Extracted value '%@' from %@ and appended it to %@";

/* String indicating that text has been extracted from a build setting into another build setting in the native target upgrading log.  Arg 1 is value extracted, arg 2 is the old setting name, arg 3 is the new setting name. */
"Extracted value '%@' from %@ into %@" = "Extracted value '%@' from %@ into %@";

/* localized type name for product type specifications */
"file type" = "file type";

/* Format string to use in build rule name for file patterns to match against. */
"Files '%@'" = "Files '%@'";

/* Error message when a dependency node depends on itself.  Arg 1 is node name. */
"File %@ depends on itself.  This target might include its own product." = "File %@ depends on itself.  This target might include its own product.";

/* Display name for framework targets */
"Framework" = "Framework";

/* Name for global variant group members */
"Global" = "Global";

/* Format used for build messages indicating file inclusion; arg 1 is the name of the file that's including another one, arg 2 is the line number of the include directive */
"In file included from %@:%u:" = "In file included from %@:%u:";

/* localized display state string for the SCM 'indeterminate' state */
"Indeterminate" = "Indeterminate";

/* Error message displayed when the Info.plist file for a target is defined but cannot be found.  Arg 1 is path to file. */
"Info.plist file at %@ missing; build setting may be incorrect." = "Info.plist file at %@ missing; build setting may be incorrect.";

/* SCM 'invalid entry' status */
"Invalid Entry" = "Invalid Entry";

/* Format string for exception description when a non-string regex was found in a build output parse rule list; arg 1 is Jambase rule name, arg 2 is index of parse rule, arg 3 is name of key in parse-info dictionary, arg 4 is type of object that was found */
"invalid regular expression in build output parse rule at index %2$u for '%3$@' key in dictionary for Jambase rule '%1$@' -- expected a string but found an %4$@" = "invalid regular expression in build output parse rule at index %2$u for '%3$@' key in dictionary for Jambase rule '%1$@' -- expected a string but found an %4$@";

/* Format string for exception description when a non-string rule action was found in a build output parse rule list; arg 1 is Jambase rule name, arg 2 is index of parse rule, arg 3 is name of key in parse-info dictionary, arg 4 is name of the invalid action */
"invalid rule action '%4$@' found in build output parse rule at index %2$u for '%3$@' key in dictionary for Jambase rule '%1$@'" = "invalid rule action '%4$@' found in build output parse rule at index %2$u for '%3$@' key in dictionary for Jambase rule '%1$@'";

/* Format string for exception description when a non-string rule action was found in a build output parse rule list; arg 1 is Jambase rule name, arg 2 is index of parse rule, arg 3 is name of key in parse-info dictionary, arg 4 is type of object that was found */
"invalid rule action found in build output parse rule at index %2$u for '%3$@' key in dictionary for Jambase rule '%1$@' -- expected a string but found an %4$@" = "invalid rule action found in build output parse rule at index %2$u for '%3$@' key in dictionary for Jambase rule '%1$@' -- expected a string but found an %4$@";

/* Error string when a build setting is not well formed (may be missing an open bracket); arg 1 is name of build setting. */
"Invalid syntax for build setting '%@' - missing '['" = "Invalid syntax for build setting '%@' - missing '['";

/* localized type name for language specifications */
"language" = "language";

/* No comment provided by engineer. */
"level %C%@%C" = "level %C%@%C";

/* Display name for library targets */
"Library" = "Library";

/* localized type name for linker specifications */
"linker" = "linker";

/* Default name of the Link Binary With Libraries build phase. */
"Link Binary With Libraries" = "Link Binary With Libraries";

/* Title for local revision in SCM inspector revision table. */
"Local" = "Local";

/* localized display state string for the SCM 'locally added' state */
/* SCM 'locally added' status */
"Locally Added" = "Locally Added";

/* localized display state string for the SCM 'locally modified' state */
/* SCM 'locally modified' status */
"Locally Modified" = "Locally Modified";

/* SCM 'locally removed' status */
/* localized display state string for the SCM 'locally removed' state */
"Locally Removed" = "Locally Removed";

/* Format string for exception description when build output parse rule with an invalid number of entries was found in Jambase-parse-info.plist; arg 1 is Jambase rule name, arg 2 is index of parse rule, arg 3 is name of key in parse-info dictionary, arg 4 is number of entries it has */
"malformed build output parse rule at index %2$u for '%3$@' key in dictionary for Jambase rule '%1$@' (array should have two entries but has %4$u entries)" = "malformed build output parse rule at index %2$u for '%3$@' key in dictionary for Jambase rule '%1$@' (array should have two entries but has %4$u entries)";

/* Format string for exception description when a non-array build output output parse rule was found in Jambase-parse-info.plist; arg 1 is Jambase rule name, arg 2 is index of parse rule, arg 3 is name of key in parse-info dictionary, arg 4 is description string of what was found */
"malformed build output parse rule at index %2$u for '%3$@' key in dictionary for Jambase rule '%1$@' (entry should be an array but is a %4$@)" = "malformed build output parse rule at index %2$u for '%3$@' key in dictionary for Jambase rule '%1$@' (entry should be an array but is a %4$@)";

/* Format string for exception message when a bad regular expression was found in a linker specification; arg 1 is tool name, arg 2 is malformed regex string, arg 3 is category of tool being loaded */
"malformed regular expression '%2$@' in specification of %3$@ %1$@" = "malformed regular expression '%2$@' in specification of %3$@ %1$@";

/* Format string for exception description when a bad regular expression was found in a build output parse rule list; arg 1 is Jambase rule name, arg 2 is index of parse rule, arg 3 is name of key in parse-info dictionary, arg 4 is malformed regex string */
"malformed regular expression '%4$@' in build output parse rule at index %2$u for '%3$@' key in dictionary for Jambase rule '%1$@'" = "malformed regular expression '%4$@' in build output parse rule at index %2$u for '%3$@' key in dictionary for Jambase rule '%1$@'";

/* Format string for exception message when a non-string was found in a regex list; arg 1 is tool name, arg 2 is type of object that was found, arg 3 is category of tool being loaded */
"malformed regular expression list in specification of %3$@ %1$@ -- expected a string but found an %2$@" = "malformed regular expression list in specification of %3$@ %1$@ -- expected a string but found an %2$@";

/* Format string for exception message when an identifier in a build rule plist doesn't match a known specification; arg 1 is name of build rule, arg 2 is name of identifier key, arg 3 is the value for the identifier key, arg 4 is the name of the class of object being looked up */
"Malformed specification of %@ -- the '%@' key '%@' does not match a known %@" = "Malformed specification of %@ -- the '%@' key '%@' does not match a known %@";

/* Format string for exception message when an empty identifier was found in a build rule plist; arg 1 is name of build rule, arg 2 is name of identifier key */
"Malformed specification of %@ -- the '%@' key must be non-empty" = "Malformed specification of %@ -- the '%@' key must be non-empty";

/* Error string when a build setting condition is missing an equals sign; arg 1 is name of build setting. */
"Missing '=' in condition subscript in build setting '%@'" = "Missing '=' in condition subscript in build setting '%@'";

/* Not applicable string for SCM revision table entries. */
"n/a" = "n/a";

/* SCM 'needs checkout' status */
"Needs Checkout" = "Needs Checkout";

/* SCM 'needs merge' status */
"Needs Merge" = "Needs Merge";

/* SCM 'needs patch' status */
"Needs Patch" = "Needs Patch";

/* localized display state string for the SCM 'remotely updated' state */
"Needs Update" = "Needs Update";

/* Default name for new groups */
"New Group" = "New Group";

/* localized display state string for the SCM no state' state */
"Not In Repository" = "Not In Repository";

/* localized display state string for the SCM 'Not Supported' state */
"Not Supported" = "Not Supported";

/* String indicating that no build settings were converted in the native target upgrading log. */
"No build settings converted." = "No build settings converted.";

/* No comment provided by engineer. */
"off" = "off";

/* No comment provided by engineer. */
"on" = "on";

/* localized type name for package type specifications */
"package type" = "package type";

/* localized type name for platform specifications */
"platform" = "platform";

/* Message status format used when nothing more specific is available; arg 1 is name of file being processed by rule */
"Process %@" = "Process %@";

/* Progress format used when nothing more specific is available; arg 1 is name of file being processed by rule */
"Processing %@" = "Processing %@";

/* localized type name for product type specifications */
"product type" = "product type";

/* Error message when project cannot be opened because it is missing its project.pbxproj file. */
"Project %@ cannot be opened because it is missing its project.pbxproj file." = "Project %@ cannot be opened because it is missing its project.pbxproj file.";

/* Error message when project cannot be opened because the project file cannot be parsed. */
"Project %@ cannot be opened because the project file cannot be parsed." = "Project %@ cannot be opened because the project file cannot be parsed.";

/* Error message when project cannot be opened because the user file cannot be parsed. */
"Project %@ cannot be opened because the user file cannot be parsed." = "Project %@ cannot be opened because the user file cannot be parsed.";

/* Error message when project cannot be opened because an exception occurred. */
"Project %@ cannot be opened because an exception occurred: %@" = "Project %@ cannot be opened because an exception occurred: %@";

/* String indicating that a build setting has been renamed in the native target upgrading log.  Arg 1 is old setting name, arg 2 is new setting name. */
"Renamed %@ to %@" = "Renamed %@ to %@";

/* String appended when a request is completely successfully but we have no specific status to report. */
"Request completed successfully." = "Request completed successfully.";

/* SCM 'sandbox only' status */
"Sandbox Only" = "Sandbox Only";

/* localized type name for SCM specifications */
"SCM" = "SCM";

/* String to use in build rule name for compiler which is a script. */
"Script" = "Script";

/* Format string for error message when a string cannot be parsed as a set of variable assignments because an one of the lines doesn't contain an equals sign; arg 1 is the invalid line string. */
"String '%@' isn't a valid build setting assignment" = "String '%@' isn't a valid build setting assignment";

/* Default name of the Run Script build phase. */
"Run Script" = "Run Script";

/* String to display in popup menu to indicate that a build rule should process files matching regular expression patterns. */
"Source files with names matching:" = "Source files with names matching:";

/* Name template for target bookmarks.  Argument is replaced with target name. */
"Target: %@" = "Target: %@";

/* Message when a build cannot start due to an unknown problem. */
"The build is being delayed for an unknown reason..." = "The build is being delayed for an unknown reason…";

/* Message when an operation cannot be run after having been pended, and we don't know why. */
"The build was delayed and now cannot be run for an unknown reason." = "The build was delayed and now cannot be run for an unknown reason.";

/* Message that xcconfig file has invalid format; arg 1 is name of settings file, arg 2 is error returned parsing file. */
"Ignoring build settings configuration file %@ due to an error: %@." = "Ignoring build settings configuration file %@ due to an error: %@.";

/* Display name for tool targets */
"Tool" = "Tool";

/* localized type name for tool specifications */
"tool" = "tool";

/* SCM 'uncommittable conflict' status */
"Uncommittable Conflict" = "Uncommittable Conflict";

/* SCM 'unknown' status */
/* localized display state string for the SCM 'unknown status' state */
"Unknown" = "Unknown";

/* SCM 'up to date' status */
/* localized display state string for the SCM 'up to date' state */
"Up To Date" = "Up To Date";

/* SCM 'update needed' status */
"Update Needed" = "Update Needed";

/* Display name for generic wrapped targets */
"Wrapped Target" = "Wrapped Target";

/* Title string shown in the build log when building an external target. */
"%@ external target \"%@\" of project \"%@\"" = "%@ external target \"%@\" of project \"%@\"";

/* Title string shown in the build log when building a target with a build style. */
"Native Build of Target \"%@\" of Project \"%@\" using Build Style \"%@\"" = "Native Build of Target \"%@\" of Project \"%@\" using Build Style \"%@\"";

/* Title string shown in the build log when building a target without a build style. */
"Native Build of Target \"%@\" of Project \"%@\" without using a Build Style." = "Native Build of Target \"%@\" of Project \"%@\" without using a Build Style.";

/* Title string shown in the build log when building a target with a build configuration. */
"Native Build of Target \"%@\" of Project \"%@\" using Build Configuration \"%@\"" = "Native Build of Target \"%@\" of Project \"%@\" using Build Configuration \"%@\"";

/* Title string shown in the build log when building a target with the default build configuration. */
"Native Build of Target \"%@\" of Project \"%@\" using the default build configuration (\"%@\")" = "Native Build of Target \"%@\" of Project \"%@\" using the default build configuration (\"%@\")";

/* Format string used when building a target without the per-configuration build directories enabled. */
"%@ without per-configuration build directories." = "%@ without per-configuration build directories.";

/* Format string for SCM tools that don't exist. */
"Task not found at path: %@" = "Task not found at path: %@";

/* Format string for showing SCM revision information.. */
"Filename: %@\nRevision: %@\nDate: %@\nAuthor: %@\n" = "Filename: %@\nRevision: %@\nDate: %@\nAuthor: %@\n";

/* Format string for showing SCM revision information with change info. */
"Filename: %@\nRevision: %@\nChange: %@\nDate: %@\nAuthor: %@\n" = "Filename: %@\nRevision: %@\nChange: %@\nDate: %@\nAuthor: %@\n";

/* Missing dependency target string. */
"Missing dependency target \"%@\"" = "Missing dependency target \"%@\"";

/* Text for explanation of denial when trying to delete target executables */
"Executables representing target products cannot be deleted." = "Executables representing target products cannot be deleted.";

/* C++ Exception Breakpoints */
"ENTER CPP THROW BP" = "Enter the name of the thrown C++ exception you would like to break on ('$' indicates all exceptions)";
"ENTER CPP CATCH BP" = "Enter the name of the caught C++ exception you would like to break on ('$' indicates all exceptions)";
"ENTER CPP PLACEHOLDER" = "'$' indicates all exceptions";
"ENTER CPP CATCH/THROW BP $" = "Enter the name of the C++ exception ('$' indicates all exceptions)";
"ENTER CPP CATCH/THROW BP" = "Enter the name of the C++ exception";
"ENTER CPP CATCH/THROW BACKGROUND" = "Enter Exception (or leave blank for all)";
"C++ Exception" = "C++ Exception";
"On Catch" = "Catch";
"On Throw" = "Throw";
"All Exceptions" = "All Exceptions";

/* Format string for display name of modeled property symbols. */
"%@ \\u261e %@" = "%1$@ ☞ %2$@";

/* Refactoring */

/* Strings or format strings for snapshot titles */
"Before Rename %@" = "Before Rename %@";
"Before Create Superclass of %@" = "Before Create Superclass of %@";
"Before Move Up %@" = "Before Move Up %@";
"Before Encapsulate %@" = "Before Encapsulate %@";
"Before Inline %@" = "Before Inline %@";
"Before Modernize Loop" = "Before Modernize Loop";
"Before Convert to Objective-C 2.0" = "Before Convert to Objective-C 2.0";

/* Refactoring selection error messages */

"Make a different selection and try again." = "Make a different selection and try again.";
"The selection does not contain identifiable content." = "The selection does not contain identifiable content.";
"Edit a C or Objective-C source code file to include or import this header file and try again." = "Edit a C or Objective-C source code file to include or import this header file and try again.";
"The selection is in a header file that is not referred to by any C or Objective-C source code files." = "The selection is in a header file that is not referred to by any C or Objective-C source code files.";
/* Rename message */
"The selection is not a type that can be renamed." = "The selection is not a type that can be renamed.";
"Select the property instead and try again." = "Select the property instead and try again.";
"The selection is a property's synthesized setter or getter method and can't be renamed independently." = "The selection is a property’s synthesized setter or getter method and can’t be renamed independently.";

/* Extract message */
"The selection does not contain anything that can be extracted." = "The selection does not contain anything that can be extracted.";
/* Create superclass message */
"The selection is not an Objective-C class." = "The selection is not an Objective-C class.";
/* Inline error message */
/* Add parameter message */
"The selection is not a function." = "The selection is not a function.";
/* Move up message */
"The selection is not an Objective-C class's method or instance variable." = "The selection is not an Objective-C class’s method or instance variable.";
/* Move down message */
"The selection is not an Objective-C class's instance variable." = "The selection is not an Objective-C class’s instance variable.";
/* Encapsulate message */
"The selection is not a field in a C structure or union or an Objective-C class's instance variable." = "The selection is not a field in a C structure or union or an Objective-C class’s instance variable.";
/* Modernize loop message */
"The selection is not a for or while loop." = "The selection is not a for or while loop.";

/* Refactoring text input validator messages */

"Must be different than subclass" = "Must be different than subclass";
"Only Roman letters, digits, underscores, and colons are permitted" = "Only Roman letters, digits, underscores, and colons are permitted";
"Only Roman letters, digits, and underscores are permitted" = "Only Roman letters, digits, and underscores are permitted";
"Must be one or more characters" = "Must be one or more characters";
"First character cannot be a digit" = "First character cannot be a digit";
"Needs 1 more colon to match original" = "Needs 1 more colon to match original";
"Needs %d more colons to match original" = "Needs %d more colons to match original";
"Needs 1 fewer colon to match original" = "Needs 1 fewer colon to match original";
"Needs %d fewer colons to match original" = "Needs %d fewer colons to match original";
"First character cannot be a colon" = "First character cannot be a colon";
"Last character must be a colon" = "Last character must be a colon";
"Must be different than original" = "Must be different than original";
"Setter and getter must be different" = "Setter and getter must be different";
"%@ of same name already exists" = "%@ of same name already exists";
"Class of same name already exists" = "Class of same name already exists";
"'%@' is a reserved language keyword" = "‘%@’ is a reserved language keyword";
"Only punctuation in original signature are permitted" = "Only punctuation in original signature are permitted";
"Instance method must start with -" = "Instance method must start with -";
"Class method must start with +" = "Class method must start with +";
"Must be ( after function name" = "Must be ( after function name";
"Function must end with )" = "Function must end with )";
"Must be , after all but last parameter" = "Must be , after all but last parameter";
"Signature ended prematurely" = "Signature ended prematurely";
"Return type doesn't match original \"%@\"" = "Return type doesn’t match original “%@”";
"Left side of return type doesn't match original \"%@\"" = "Left side of return type doesn’t match original “%@”";
"Right side of return type doesn't match original \"%@\"" = "Right side of return type doesn’t match original “%@”";
"Return type missing remaining text \"%@\"" = "Return type missing remaining text “%@”";
"Left side of return type missing remaining text \"%@\"" = "Left side of return type missing remaining text “%@”";
"Right side of return type missing remaining text \"%@\"" = "Right side of return type missing remaining text “%@”";
"Parameter type missing remaining text \"%@\"" = "Parameter type missing remaining text “%@”";
"Left side of parameter type missing remaining text \"%@\"" = "Left side of parameter type missing remaining text “%@”";
"Right side of parameter type missing remaining text \"%@\"" = "Right side of parameter type missing remaining text “%@”";
"Parameter %d has same name \"%@\" as parameter %d" = "Parameter %d has same name “%@” as parameter %d";
"Extra characters after signature" = "Extra characters after signature";

"Type doesn't match remaining original types:%@" = "Type doesn’t match remaining original types:%@";
/* Format string for individual type in type list */
" \"%@\"" = " “%@”";

/* %@ is a capitalized phrase: see capitalized phrases, immediately below */
"%@ may not start with a digit" = "%@ may not start with a digit";
"%@ must be within parentheses" = "%@ must be within parentheses";
"%@ must be be followed by whitespace" = "%@ must be be followed by whitespace";
"%@ must be followed by a comma" = "%@ must be followed by a comma";
"%@ must be one or more characters" = "%@ must be one or more characters";
"%@ missing" = "%@ missing";

/* Capitalized phrases */
"Method keyword %d \"%@\"" = "Method keyword %d “%@”";
"Return type \"%@\"" = "Return type “%@”";
"Left side of return type \"%@\"" = "Left side of return type “%@”";
"Type" = "Type";
"Left side of type" = "Left side of type";
"Parameter %d name" = "Parameter %d name";
"Function name" = "Function name";
"Function parameters" = "Function parameters";
"Method name" = "Method name";
"Method keyword %d" = "Method keyword %d";
"Colon" = "Colon";

/* Create superclass file recovery suggestion and error messages */
"New file \"%@\" location, \"%@\", does not exist." = "New file “%@” location, “%@”, does not exist.";
"Create a folder at that location." = "Create a folder at that location.";

"New file \"%@\" location, \"%@\", is itself a file, not a folder." = "New file “%@” location, “%@”, is itself a file, not a folder.";
"Move file aside and create a folder at that location." = "Move file aside and create a folder at that location.";

"Unable to create new file \"%@\" at location \"%@\"." = "Unable to create new file “%@” at location “%@”.";
"Check whether folder is locked or is not writable." = "Check whether folder is locked or is not writable.";

"New file \"%@\" location, \"%@\", already contains a file of that name." = "New file “%@” location, “%@”, already contains a file of that name.";
"Move existing file to another location." = "Move existing file to another location.";

"New file \"%@\" cannot be made because referenced file \"%@\" is not in project." = "New file “%@” cannot be made because referenced file “%@” is not in project.";
"Ensure referenced file is in project." = "Ensure referenced file is in project.";

"New file \"%@\" cannot be added to a group because referenced file \"%@\" is not in a group." = "New file “%@” cannot be added to a group because referenced file “%@” is not in a group.";
"Add file to a group." = "Add file to a group.";

"New file \"%@\" cannot be added to group \"%@\"." = "New file “%@” cannot be added to group “%@”.";
"Check that group is a type that files can be added to." = "Check that group is a type that files can be added to.";

"New file \"%@\" was created and added to the project but could not be added to the repository due to an unknown SCM error." = "New file “%@” was created and added to the project but could not be added to the repository due to an unknown SCM error.";
"New file \"%@\" was created and added to the project but could not be added to the repository: %@." = "New file “%@” was created and added to the project but could not be added to the repository: %@.";

/* Other errors */
"%@, which owns %@, is not a class." = "%@, which owns %@, is not a class.";
"%@ has no subclasses." = "%@ has no subclasses.";
"%@ should have 1 subclass, but instead has %lu." = "%@ should have 1 subclass, but instead has %lu.";
"Delete the files at this location, reinstall Xcode Tools, and try again." = "Delete the files at this location, reinstall Xcode Tools, and try again.";
"The files at %@ that are needed for this operation are invalid." = "The files at %@ that are needed for this operation are invalid.";
"Reinstall Xcode Tools and try again." = "Reinstall Xcode Tools and try again.";
"Some files from the Xcode Tools installation needed for this operation are missing." = "Some files from the Xcode Tools installation needed for this operation are missing.";

"Can't delete text in or near selection, possiby due to macros. Please change manually if appropriate." = "Can’t delete text in or near selection, possiby due to macros. Please change manually if appropriate.";
"Can't modify text in or near selection, possiby due to macros. Please change manually if appropriate." = "Can’t modify text in or near selection, possiby due to macros. Please change manually if appropriate.";

"Select a larger expression and try again." = "Select a larger expression and try again.";
"Can't replace an lvalue with a function or method invocation." = "Can’t replace an lvalue with a function or method invocation.";

"Select a different expression and try again, or extract manually." = "Select a different expression and try again, or extract manually.";
"Can't extract expression, possibly due to the presence of macros." = "Can’t extract expression, possibly due to the presence of macros.";

/* Import statement may not be correct warning message */
"Import statement may need to be changed to reflect actual location of superclass declaration." = "Import statement may need to be changed to reflect actual location of superclass declaration.";

/* Build settings recovery suggestions and error messages (for dialogs) */
"Add the file to a target and try again." = "Add the file to a target and try again.";
"File \"%@\" is in no targets and can't be analyzed." = "File “%@” is in no targets and can’t be analyzed.";
"File \"%@\" is in no targets and can't be analyzed for sake of file \"%@\"." = "File “%@” is in no targets and can’t be analyzed for sake of file “%@”.";
"Rebuild a target containing the file and try again." = "Rebuild a target containing the file and try again.";
"File \"%@\" is missing its dependency information and can't be analyzed."  = "File “%@” is missing its dependency information and can’t be analyzed.";
"File \"%@\" is missing its dependency information and can't be analyzed for sake of file \"%@\"." = "File “%@” is missing its dependency information and can’t be analyzed for sake of file “%@”.";
/* Build settings problem strings (for Errors & Warnings category of refactoring window */
"File \"%@\" is in no targets and can't be analyzed. Close refactoring, add file to target, and try again." = "File “%@” is in no targets and can’t be analyzed. Close refactoring, add file to target, and try again.";
"File \"%@\" is missing its dependency information and can't be analyzed. Close refactoring, rebuild target with file, and try again." = "File “%@” is missing its dependency information and can’t be analyzed. Close refactoring, rebuild target with file, and try again.";

/* File error messages */
"Check if file has been moved and try again." = "Check if file has been moved and try again.";
"File \"%@\" has disappeared, so preview cannot be applied." = "File “%@” has disappeared, so preview cannot be applied.";
"File is not writable. If unlocking fails, preview will only be applied to editor, and you may then Save a Copy As a new file." = "File is not writable. If unlocking fails, preview will only be applied to editor, and you may then Save a Copy As a new file.";
"File requires an SCM Edit operation to be writable. This will be attempted before preview is applied." = "File requires an SCM Edit operation to be writable. This will be attempted before preview is applied.";
"Can't make changes to %lu system-owned files." = "Can’t make changes to %lu system-owned files.";
"Can't make changes to 1 system-owned file." = "Can’t make changes to 1 system-owned file.";
"Can't make changes to %lu files that do not belong to this project." = "Can’t make changes to %lu files that do not belong to this project.";
"Can't make changes to 1 file that does not belong to this project." = "Can’t make changes to 1 file that does not belong to this project.";
"File may contain related code but will not be analyzed because it is not a C or Objective-C file." = "File may contain related code but will not be analyzed because it is not a C or Objective-C file.";
"Connections may be affected in this file. Review connections in Interface Builder after move down is complete." = "Connections may be affected in this file. Review connections in Interface Builder after move down is complete.";

/* Exception errors */
"To be safe, please save your work and quit and restart Xcode." = "To be safe, please save your work and quit and restart Xcode.";
"There was an internal error analyzing file \"%@\"." = "There was an internal error analyzing file “%@”.";
"There was an internal error." = "There was an internal error.";


/* Project File Rename */

"An unknown SCM error occurred renaming file \"%@\" to \"%@\"." = "An unknown SCM error occurred renaming file “%@” to “%@”.";
"Check that file is in project." = "Check that file is in project.";
"File \"%@\" cannot be found in project." = "File “%@” cannot be found in project.";
"File \"%@\" does not exist on disk." = "File “%@” does not exist on disk.";
"New name for file \"%@\" cannot be blank." = "New name for file “%@” cannot be blank.";
"New name for file cannot be same as old name \"%@\"." = "New name for file cannot be same as old name “%@”.";
"New name \"%@\" cannot contain a slash." = "New name “%@” cannot contain a slash.";
"Move existing file or choose another name." = "Move existing file or choose another name.";
"File with new name \"%@\" already exists at same location as file with old name \"%@\"." = "File with new name “%@” already exists at same location as file with old name “%@”.";
"A file with the name \"%@\" already exists at same location." = "A file with the name \"%@\" already exists at same location.";
"Check that file is unlocked and that its permissions allow you to change it." = "Check that file is unlocked and that its permissions allow you to change it.";
"File \"%@\" could not be renamed to \"%@\"." = "File “%@” could not be renamed to “%@”.";
"An error occurred reading the file \"%@\"" = "An error occurred reading the file \"%@\"";

/* Compatibility checking */

/* project <projectname> */
"project \"%@\"" = "project \"%@\"";
/* The name of the project setting which controls whether to build independent targets in parallel */
"setting \"Build independent targets in parallel\"" = "setting \"Build independent targets in parallel\"";
/* A file group for model versions, with the group's name */
"version group \"%@\"" = "version group \"%@\"";
/* target <targetname> */
"target \"%@\"" = "target \"%@\"";
/* <type of build phase> build phase */
"\"%@\" build phase" = "\"%@\" build phase";
/* A conditional build setting with its flavor and name */
"per-%@ condition for build setting \"%@\"" = "per-%@ condition for build setting \"%@\"";
/* build setting <build setting name> */
"build setting %@" = "build setting %@";
/* build configuration <configuration name> */
"build configuration \"%@\"" = "build configuration \"%@\"";
/* configuration settings file <file name> */
"configuration settings file \"%@\"" = "configuration settings file \"%@\"";
/* Weakly-linked role of build file <name> */
"weak role of build file \"%@\"" = "weak role of build file \"%@\"";

/* The name of the per-architecture build settings feature */
"Per-architecture build settings" = "Per-architecture build settings";
/* The name of the per-SDK build settings feature */
"Per-SDK build settings" = "Per-SDK build settings";
/* The name of the versioned data models feature */
"Versioned data models" = "Versioned data models";
/* The name of the parallel target builds feature */
"Parallel target builds" = "Parallel target builds";
/* The name of the composite SDKs feature */
"Composite SDKs" = "Composite SDKs";
/* The name of the weakly-linked library reference roles feature */
"'Weak' library roles" = "'Weak' library roles";
/* New build settings features */
"%@ build settings" = "%@ build settings";
/* Multiple project roots */
"Multiple project roots" = "Multiple project roots";
/* Location of the project roots setting */
"the project roots setting in the General tab of the Project Inspector" = "the project roots setting in the General tab of the Project Inspector";
/* Seperator implying containment between segments of a path; the path describes how to find something in a project. E.g., this could become ' of project myProject' and be appended to 'target myTarget'. */
" of %@" = " of %@";

/* Suffix appended to name of project format indicating that the format enforces compatibility (e.g., Xcode 2.4 format becomes 'Xcode 2.4-compatible' format. */
"-compatible" = "-compatible";

/* Family names of known SDK families */
"macosx" = "Mac OS X";
"iphone" = "iOS";
"iphoneos" = "iOS";
"iphonesimulator" = "iOS Simulator";
"unknownSDK" = "Unknown OS";

/* Format strings for SDK names in the user interface */
"%@ %@" = "%@ %@";
"%@ %@ internal" = "%@ %@ internal";
"%@ %@ (missing)" = "%@ %@ (missing)";


